Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_BLK_CTRL_NS_AONMIX.h
/*! @name FUSE_ACC_DIS - Fuse access disable register */
/*! @{ */

#define BLK_CTRL_NS_AONMIX_FUSE_ACC_DIS_OSCCA_FUSE_READ_DIS_MASK (0x1U)
#define BLK_CTRL_NS_AONMIX_FUSE_ACC_DIS_OSCCA_FUSE_READ_DIS_SHIFT (0U)
/*! OSCCA_FUSE_READ_DIS - Fuse read disable flag
 *  0b0..Read is allowed
 *  0b1..Read is not allowed
 */
#define BLK_CTRL_NS_AONMIX_FUSE_ACC_DIS_OSCCA_FUSE_READ_DIS(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_NS_AONMIX_FUSE_ACC_DIS_OSCCA_FUSE_READ_DIS_SHIFT)) & BLK_CTRL_NS_AONMIX_FUSE_ACC_DIS_OSCCA_FUSE_READ_DIS_MASK)

#define BLK_CTRL_NS_AONMIX_FUSE_ACC_DIS_OCOTP_CALIBRATED_MASK (0x2U)
#define BLK_CTRL_NS_AONMIX_FUSE_ACC_DIS_OCOTP_CALIBRATED_SHIFT (1U)
/*! OCOTP_CALIBRATED - Fuse calibrate flag
 *  0b0..OCOTP is not calibrated
 *  0b1..OCOTP is calibrated
 */
#define BLK_CTRL_NS_AONMIX_FUSE_ACC_DIS_OCOTP_CALIBRATED(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_NS_AONMIX_FUSE_ACC_DIS_OCOTP_CALIBRATED_SHIFT)) & BLK_CTRL_NS_AONMIX_FUSE_ACC_DIS_OCOTP_CALIBRATED_MASK)

#define BLK_CTRL_NS_AONMIX_FUSE_ACC_DIS_OCOTP_BUSY_MASK (0x4U)
#define BLK_CTRL_NS_AONMIX_FUSE_ACC_DIS_OCOTP_BUSY_SHIFT (2U)
/*! OCOTP_BUSY - OCOTP busy flag
 *  0b0..OCOTP is not busy
 *  0b1..OCOTP is busy
 */
#define BLK_CTRL_NS_AONMIX_FUSE_ACC_DIS_OCOTP_BUSY(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_NS_AONMIX_FUSE_ACC_DIS_OCOTP_BUSY_SHIFT)) & BLK_CTRL_NS_AONMIX_FUSE_ACC_DIS_OCOTP_BUSY_MASK)
/*! @} */

/*! @name M33_NMI_CLR - M33 NMI interrupt clear register */
/*! @{ */

#define BLK_CTRL_NS_AONMIX_M33_NMI_CLR_M33_NMI_CLEAR_MASK (0x1U)
#define BLK_CTRL_NS_AONMIX_M33_NMI_CLR_M33_NMI_CLEAR_SHIFT (0U)
/*! M33_NMI_CLEAR - Clear CM33 NMI holding register */
#define BLK_CTRL_NS_AONMIX_M33_NMI_CLR_M33_NMI_CLEAR(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_NS_AONMIX_M33_NMI_CLR_M33_NMI_CLEAR_SHIFT)) & BLK_CTRL_NS_AONMIX_M33_NMI_CLR_M33_NMI_CLEAR_MASK)
/*! @} */

/*! @name I3C1_ASYNC_WAKEUP_CTRL - I3C1 async wakeup control register */
/*! @{ */

#define BLK_CTRL_NS_AONMIX_I3C1_ASYNC_WAKEUP_CTRL_IRQ_CLR_MASK (0x1U)
#define BLK_CTRL_NS_AONMIX_I3C1_ASYNC_WAKEUP_CTRL_IRQ_CLR_SHIFT (0U)
/*! IRQ_CLR - Async wakeup interrupt clear */
#define BLK_CTRL_NS_AONMIX_I3C1_ASYNC_WAKEUP_CTRL_IRQ_CLR(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_NS_AONMIX_I3C1_ASYNC_WAKEUP_CTRL_IRQ_CLR_SHIFT)) & BLK_CTRL_NS_AONMIX_I3C1_ASYNC_WAKEUP_CTRL_IRQ_CLR_MASK)

#define BLK_CTRL_NS_AONMIX_I3C1_ASYNC_WAKEUP_CTRL_IRQ_STATUS_MASK (0x10000U)
#define BLK_CTRL_NS_AONMIX_I3C1_ASYNC_WAKEUP_CTRL_IRQ_STATUS_SHIFT (16U)
/*! IRQ_STATUS - Async wakeup interrupt status
 *  0b0..Interrupt not asserted
 *  0b1..Interrupt asserted
 */
#define BLK_CTRL_NS_AONMIX_I3C1_ASYNC_WAKEUP_CTRL_IRQ_STATUS(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_NS_AONMIX_I3C1_ASYNC_WAKEUP_CTRL_IRQ_STATUS_SHIFT)) & BLK_CTRL_NS_AONMIX_I3C1_ASYNC_WAKEUP_CTRL_IRQ_STATUS_MASK)
/*! @} */

/*! @name MISC_IO_CTRL - Miscellaneous control register of IO */
/*! @{ */

#define BLK_CTRL_NS_AONMIX_MISC_IO_CTRL_I3C_ON_CHIP_STRONG_PULL_DIS_MASK (0x1U)
#define BLK_CTRL_NS_AONMIX_MISC_IO_CTRL_I3C_ON_CHIP_STRONG_PULL_DIS_SHIFT (0U)
/*! I3C_ON_CHIP_STRONG_PULL_DIS - Disable I3C on-chip strong pull for I3C1
 *  0b0..On-chip strong pull is enabled
 *  0b1..On-chip strong pull is disabled
 */
#define BLK_CTRL_NS_AONMIX_MISC_IO_CTRL_I3C_ON_CHIP_STRONG_PULL_DIS(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_NS_AONMIX_MISC_IO_CTRL_I3C_ON_CHIP_STRONG_PULL_DIS_SHIFT)) & BLK_CTRL_NS_AONMIX_MISC_IO_CTRL_I3C_ON_CHIP_STRONG_PULL_DIS_MASK)

#define BLK_CTRL_NS_AONMIX_MISC_IO_CTRL_GPIO_AON_HIGH_RANGE_MASK (0x2U)
#define BLK_CTRL_NS_AONMIX_MISC_IO_CTRL_GPIO_AON_HIGH_RANGE_SHIFT (1U)
/*! GPIO_AON_HIGH_RANGE - GPIO_AON IO bank supply voltage range selection */
#define BLK_CTRL_NS_AONMIX_MISC_IO_CTRL_GPIO_AON_HIGH_RANGE(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_NS_AONMIX_MISC_IO_CTRL_GPIO_AON_HIGH_RANGE_SHIFT)) & BLK_CTRL_NS_AONMIX_MISC_IO_CTRL_GPIO_AON_HIGH_RANGE_MASK)

#define BLK_CTRL_NS_AONMIX_MISC_IO_CTRL_GPIO_AON_LOW_RANGE_MASK (0x4U)
#define BLK_CTRL_NS_AONMIX_MISC_IO_CTRL_GPIO_AON_LOW_RANGE_SHIFT (2U)
/*! GPIO_AON_LOW_RANGE - GPIO_AON IO bank supply voltage range selection */
#define BLK_CTRL_NS_AONMIX_MISC_IO_CTRL_GPIO_AON_LOW_RANGE(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_NS_AONMIX_MISC_IO_CTRL_GPIO_AON_LOW_RANGE_SHIFT)) & BLK_CTRL_NS_AONMIX_MISC_IO_CTRL_GPIO_AON_LOW_RANGE_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group BLK_CTRL_NS_AONMIX_Register_Masks */


/*!
 * @}
 */ /* end of group BLK_CTRL_NS_AONMIX_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_BLK_CTRL_NS_AONMIX_H_ */

